Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/regs/cam_reg.h
/* 0x44 : frame_byte_cnt0_0 */
#define CAM_FRAME_BYTE_CNT0_0_OFFSET (0x44)
#define CAM_FRAME_BYTE_CNT_0_0       CAM_FRAME_BYTE_CNT_0_0
#define CAM_FRAME_BYTE_CNT_0_0_POS   (0U)
#define CAM_FRAME_BYTE_CNT_0_0_LEN   (32U)
#define CAM_FRAME_BYTE_CNT_0_0_MSK   (((1U << CAM_FRAME_BYTE_CNT_0_0_LEN) - 1) << CAM_FRAME_BYTE_CNT_0_0_POS)
#define CAM_FRAME_BYTE_CNT_0_0_UMSK  (~(((1U << CAM_FRAME_BYTE_CNT_0_0_LEN) - 1) << CAM_FRAME_BYTE_CNT_0_0_POS))

/* 0x48 : frame_start_addr0_1 */
#define CAM_FRAME_START_ADDR0_1_OFFSET (0x48)
#define CAM_FRAME_START_ADDR_0_1       CAM_FRAME_START_ADDR_0_1
#define CAM_FRAME_START_ADDR_0_1_POS   (0U)
#define CAM_FRAME_START_ADDR_0_1_LEN   (32U)
#define CAM_FRAME_START_ADDR_0_1_MSK   (((1U << CAM_FRAME_START_ADDR_0_1_LEN) - 1) << CAM_FRAME_START_ADDR_0_1_POS)
#define CAM_FRAME_START_ADDR_0_1_UMSK  (~(((1U << CAM_FRAME_START_ADDR_0_1_LEN) - 1) << CAM_FRAME_START_ADDR_0_1_POS))

/* 0x4C : frame_byte_cnt0_1 */
#define CAM_FRAME_BYTE_CNT0_1_OFFSET (0x4C)
#define CAM_FRAME_BYTE_CNT_0_1       CAM_FRAME_BYTE_CNT_0_1
#define CAM_FRAME_BYTE_CNT_0_1_POS   (0U)
#define CAM_FRAME_BYTE_CNT_0_1_LEN   (32U)
#define CAM_FRAME_BYTE_CNT_0_1_MSK   (((1U << CAM_FRAME_BYTE_CNT_0_1_LEN) - 1) << CAM_FRAME_BYTE_CNT_0_1_POS)
#define CAM_FRAME_BYTE_CNT_0_1_UMSK  (~(((1U << CAM_FRAME_BYTE_CNT_0_1_LEN) - 1) << CAM_FRAME_BYTE_CNT_0_1_POS))

/* 0x50 : frame_start_addr0_2 */
#define CAM_FRAME_START_ADDR0_2_OFFSET (0x50)
#define CAM_FRAME_START_ADDR_0_2       CAM_FRAME_START_ADDR_0_2
#define CAM_FRAME_START_ADDR_0_2_POS   (0U)
#define CAM_FRAME_START_ADDR_0_2_LEN   (32U)
#define CAM_FRAME_START_ADDR_0_2_MSK   (((1U << CAM_FRAME_START_ADDR_0_2_LEN) - 1) << CAM_FRAME_START_ADDR_0_2_POS)
#define CAM_FRAME_START_ADDR_0_2_UMSK  (~(((1U << CAM_FRAME_START_ADDR_0_2_LEN) - 1) << CAM_FRAME_START_ADDR_0_2_POS))

/* 0x54 : frame_byte_cnt0_2 */
#define CAM_FRAME_BYTE_CNT0_2_OFFSET (0x54)
#define CAM_FRAME_BYTE_CNT_0_2       CAM_FRAME_BYTE_CNT_0_2
#define CAM_FRAME_BYTE_CNT_0_2_POS   (0U)
#define CAM_FRAME_BYTE_CNT_0_2_LEN   (32U)
#define CAM_FRAME_BYTE_CNT_0_2_MSK   (((1U << CAM_FRAME_BYTE_CNT_0_2_LEN) - 1) << CAM_FRAME_BYTE_CNT_0_2_POS)
#define CAM_FRAME_BYTE_CNT_0_2_UMSK  (~(((1U << CAM_FRAME_BYTE_CNT_0_2_LEN) - 1) << CAM_FRAME_BYTE_CNT_0_2_POS))

/* 0x58 : frame_start_addr0_3 */
#define CAM_FRAME_START_ADDR0_3_OFFSET (0x58)
#define CAM_FRAME_START_ADDR_0_3       CAM_FRAME_START_ADDR_0_3
#define CAM_FRAME_START_ADDR_0_3_POS   (0U)
#define CAM_FRAME_START_ADDR_0_3_LEN   (32U)
#define CAM_FRAME_START_ADDR_0_3_MSK   (((1U << CAM_FRAME_START_ADDR_0_3_LEN) - 1) << CAM_FRAME_START_ADDR_0_3_POS)
#define CAM_FRAME_START_ADDR_0_3_UMSK  (~(((1U << CAM_FRAME_START_ADDR_0_3_LEN) - 1) << CAM_FRAME_START_ADDR_0_3_POS))

/* 0x5C : frame_byte_cnt0_3 */
#define CAM_FRAME_BYTE_CNT0_3_OFFSET (0x5C)
#define CAM_FRAME_BYTE_CNT_0_3       CAM_FRAME_BYTE_CNT_0_3
#define CAM_FRAME_BYTE_CNT_0_3_POS   (0U)
#define CAM_FRAME_BYTE_CNT_0_3_LEN   (32U)
#define CAM_FRAME_BYTE_CNT_0_3_MSK   (((1U << CAM_FRAME_BYTE_CNT_0_3_LEN) - 1) << CAM_FRAME_BYTE_CNT_0_3_POS)
#define CAM_FRAME_BYTE_CNT_0_3_UMSK  (~(((1U << CAM_FRAME_BYTE_CNT_0_3_LEN) - 1) << CAM_FRAME_BYTE_CNT_0_3_POS))

/* 0x60 : frame_start_addr0_4 */
#define CAM_FRAME_START_ADDR0_4_OFFSET (0x60)
#define CAM_FRAME_START_ADDR_0_4       CAM_FRAME_START_ADDR_0_4
#define CAM_FRAME_START_ADDR_0_4_POS   (0U)
#define CAM_FRAME_START_ADDR_0_4_LEN   (32U)
#define CAM_FRAME_START_ADDR_0_4_MSK   (((1U << CAM_FRAME_START_ADDR_0_4_LEN) - 1) << CAM_FRAME_START_ADDR_0_4_POS)
#define CAM_FRAME_START_ADDR_0_4_UMSK  (~(((1U << CAM_FRAME_START_ADDR_0_4_LEN) - 1) << CAM_FRAME_START_ADDR_0_4_POS))

/* 0x64 : frame_byte_cnt0_4 */
#define CAM_FRAME_BYTE_CNT0_4_OFFSET (0x64)
#define CAM_FRAME_BYTE_CNT_0_4       CAM_FRAME_BYTE_CNT_0_4
#define CAM_FRAME_BYTE_CNT_0_4_POS   (0U)
#define CAM_FRAME_BYTE_CNT_0_4_LEN   (32U)
#define CAM_FRAME_BYTE_CNT_0_4_MSK   (((1U << CAM_FRAME_BYTE_CNT_0_4_LEN) - 1) << CAM_FRAME_BYTE_CNT_0_4_POS)
#define CAM_FRAME_BYTE_CNT_0_4_UMSK  (~(((1U << CAM_FRAME_BYTE_CNT_0_4_LEN) - 1) << CAM_FRAME_BYTE_CNT_0_4_POS))

/* 0x68 : frame_start_addr0_5 */
#define CAM_FRAME_START_ADDR0_5_OFFSET (0x68)
#define CAM_FRAME_START_ADDR_0_5       CAM_FRAME_START_ADDR_0_5
#define CAM_FRAME_START_ADDR_0_5_POS   (0U)
#define CAM_FRAME_START_ADDR_0_5_LEN   (32U)
#define CAM_FRAME_START_ADDR_0_5_MSK   (((1U << CAM_FRAME_START_ADDR_0_5_LEN) - 1) << CAM_FRAME_START_ADDR_0_5_POS)
#define CAM_FRAME_START_ADDR_0_5_UMSK  (~(((1U << CAM_FRAME_START_ADDR_0_5_LEN) - 1) << CAM_FRAME_START_ADDR_0_5_POS))

/* 0x6C : frame_byte_cnt0_5 */
#define CAM_FRAME_BYTE_CNT0_5_OFFSET (0x6C)
#define CAM_FRAME_BYTE_CNT_0_5       CAM_FRAME_BYTE_CNT_0_5
#define CAM_FRAME_BYTE_CNT_0_5_POS   (0U)
#define CAM_FRAME_BYTE_CNT_0_5_LEN   (32U)
#define CAM_FRAME_BYTE_CNT_0_5_MSK   (((1U << CAM_FRAME_BYTE_CNT_0_5_LEN) - 1) << CAM_FRAME_BYTE_CNT_0_5_POS)
#define CAM_FRAME_BYTE_CNT_0_5_UMSK  (~(((1U << CAM_FRAME_BYTE_CNT_0_5_LEN) - 1) << CAM_FRAME_BYTE_CNT_0_5_POS))

/* 0x70 : frame_start_addr0_6 */
#define CAM_FRAME_START_ADDR0_6_OFFSET (0x70)
#define CAM_FRAME_START_ADDR_0_6       CAM_FRAME_START_ADDR_0_6
#define CAM_FRAME_START_ADDR_0_6_POS   (0U)
#define CAM_FRAME_START_ADDR_0_6_LEN   (32U)
#define CAM_FRAME_START_ADDR_0_6_MSK   (((1U << CAM_FRAME_START_ADDR_0_6_LEN) - 1) << CAM_FRAME_START_ADDR_0_6_POS)
#define CAM_FRAME_START_ADDR_0_6_UMSK  (~(((1U << CAM_FRAME_START_ADDR_0_6_LEN) - 1) << CAM_FRAME_START_ADDR_0_6_POS))

/* 0x74 : frame_byte_cnt0_6 */
#define CAM_FRAME_BYTE_CNT0_6_OFFSET (0x74)
#define CAM_FRAME_BYTE_CNT_0_6       CAM_FRAME_BYTE_CNT_0_6
#define CAM_FRAME_BYTE_CNT_0_6_POS   (0U)
#define CAM_FRAME_BYTE_CNT_0_6_LEN   (32U)
#define CAM_FRAME_BYTE_CNT_0_6_MSK   (((1U << CAM_FRAME_BYTE_CNT_0_6_LEN) - 1) << CAM_FRAME_BYTE_CNT_0_6_POS)
#define CAM_FRAME_BYTE_CNT_0_6_UMSK  (~(((1U << CAM_FRAME_BYTE_CNT_0_6_LEN) - 1) << CAM_FRAME_BYTE_CNT_0_6_POS))

/* 0x78 : frame_start_addr0_7 */
#define CAM_FRAME_START_ADDR0_7_OFFSET (0x78)
#define CAM_FRAME_START_ADDR_0_7       CAM_FRAME_START_ADDR_0_7
#define CAM_FRAME_START_ADDR_0_7_POS   (0U)
#define CAM_FRAME_START_ADDR_0_7_LEN   (32U)
#define CAM_FRAME_START_ADDR_0_7_MSK   (((1U << CAM_FRAME_START_ADDR_0_7_LEN) - 1) << CAM_FRAME_START_ADDR_0_7_POS)
#define CAM_FRAME_START_ADDR_0_7_UMSK  (~(((1U << CAM_FRAME_START_ADDR_0_7_LEN) - 1) << CAM_FRAME_START_ADDR_0_7_POS))

/* 0x7C : frame_byte_cnt0_7 */
#define CAM_FRAME_BYTE_CNT0_7_OFFSET (0x7C)
#define CAM_FRAME_BYTE_CNT_0_7       CAM_FRAME_BYTE_CNT_0_7
#define CAM_FRAME_BYTE_CNT_0_7_POS   (0U)
#define CAM_FRAME_BYTE_CNT_0_7_LEN   (32U)
#define CAM_FRAME_BYTE_CNT_0_7_MSK   (((1U << CAM_FRAME_BYTE_CNT_0_7_LEN) - 1) << CAM_FRAME_BYTE_CNT_0_7_POS)
#define CAM_FRAME_BYTE_CNT_0_7_UMSK  (~(((1U << CAM_FRAME_BYTE_CNT_0_7_LEN) - 1) << CAM_FRAME_BYTE_CNT_0_7_POS))

