Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/regs/cam_reg.h
/* 0x80 : frame_start_addr1_0 */
#define CAM_FRAME_START_ADDR1_0_OFFSET (0x80)
#define CAM_FRAME_START_ADDR_1_0       CAM_FRAME_START_ADDR_1_0
#define CAM_FRAME_START_ADDR_1_0_POS   (0U)
#define CAM_FRAME_START_ADDR_1_0_LEN   (32U)
#define CAM_FRAME_START_ADDR_1_0_MSK   (((1U << CAM_FRAME_START_ADDR_1_0_LEN) - 1) << CAM_FRAME_START_ADDR_1_0_POS)
#define CAM_FRAME_START_ADDR_1_0_UMSK  (~(((1U << CAM_FRAME_START_ADDR_1_0_LEN) - 1) << CAM_FRAME_START_ADDR_1_0_POS))

/* 0x84 : frame_byte_cnt1_0 */
#define CAM_FRAME_BYTE_CNT1_0_OFFSET (0x84)
#define CAM_FRAME_BYTE_CNT_1_0       CAM_FRAME_BYTE_CNT_1_0
#define CAM_FRAME_BYTE_CNT_1_0_POS   (0U)
#define CAM_FRAME_BYTE_CNT_1_0_LEN   (32U)
#define CAM_FRAME_BYTE_CNT_1_0_MSK   (((1U << CAM_FRAME_BYTE_CNT_1_0_LEN) - 1) << CAM_FRAME_BYTE_CNT_1_0_POS)
#define CAM_FRAME_BYTE_CNT_1_0_UMSK  (~(((1U << CAM_FRAME_BYTE_CNT_1_0_LEN) - 1) << CAM_FRAME_BYTE_CNT_1_0_POS))

/* 0x88 : frame_start_addr1_1 */
#define CAM_FRAME_START_ADDR1_1_OFFSET (0x88)
#define CAM_FRAME_START_ADDR_1_1       CAM_FRAME_START_ADDR_1_1
#define CAM_FRAME_START_ADDR_1_1_POS   (0U)
#define CAM_FRAME_START_ADDR_1_1_LEN   (32U)
#define CAM_FRAME_START_ADDR_1_1_MSK   (((1U << CAM_FRAME_START_ADDR_1_1_LEN) - 1) << CAM_FRAME_START_ADDR_1_1_POS)
#define CAM_FRAME_START_ADDR_1_1_UMSK  (~(((1U << CAM_FRAME_START_ADDR_1_1_LEN) - 1) << CAM_FRAME_START_ADDR_1_1_POS))

/* 0x8C : frame_byte_cnt1_1 */
#define CAM_FRAME_BYTE_CNT1_1_OFFSET (0x8C)
#define CAM_FRAME_BYTE_CNT_1_1       CAM_FRAME_BYTE_CNT_1_1
#define CAM_FRAME_BYTE_CNT_1_1_POS   (0U)
#define CAM_FRAME_BYTE_CNT_1_1_LEN   (32U)
#define CAM_FRAME_BYTE_CNT_1_1_MSK   (((1U << CAM_FRAME_BYTE_CNT_1_1_LEN) - 1) << CAM_FRAME_BYTE_CNT_1_1_POS)
#define CAM_FRAME_BYTE_CNT_1_1_UMSK  (~(((1U << CAM_FRAME_BYTE_CNT_1_1_LEN) - 1) << CAM_FRAME_BYTE_CNT_1_1_POS))

/* 0x90 : frame_start_addr1_2 */
#define CAM_FRAME_START_ADDR1_2_OFFSET (0x90)
#define CAM_FRAME_START_ADDR_1_2       CAM_FRAME_START_ADDR_1_2
#define CAM_FRAME_START_ADDR_1_2_POS   (0U)
#define CAM_FRAME_START_ADDR_1_2_LEN   (32U)
#define CAM_FRAME_START_ADDR_1_2_MSK   (((1U << CAM_FRAME_START_ADDR_1_2_LEN) - 1) << CAM_FRAME_START_ADDR_1_2_POS)
#define CAM_FRAME_START_ADDR_1_2_UMSK  (~(((1U << CAM_FRAME_START_ADDR_1_2_LEN) - 1) << CAM_FRAME_START_ADDR_1_2_POS))

/* 0x94 : frame_byte_cnt1_2 */
#define CAM_FRAME_BYTE_CNT1_2_OFFSET (0x94)
#define CAM_FRAME_BYTE_CNT_1_2       CAM_FRAME_BYTE_CNT_1_2
#define CAM_FRAME_BYTE_CNT_1_2_POS   (0U)
#define CAM_FRAME_BYTE_CNT_1_2_LEN   (32U)
#define CAM_FRAME_BYTE_CNT_1_2_MSK   (((1U << CAM_FRAME_BYTE_CNT_1_2_LEN) - 1) << CAM_FRAME_BYTE_CNT_1_2_POS)
#define CAM_FRAME_BYTE_CNT_1_2_UMSK  (~(((1U << CAM_FRAME_BYTE_CNT_1_2_LEN) - 1) << CAM_FRAME_BYTE_CNT_1_2_POS))

/* 0x98 : frame_start_addr1_3 */
#define CAM_FRAME_START_ADDR1_3_OFFSET (0x98)
#define CAM_FRAME_START_ADDR_1_3       CAM_FRAME_START_ADDR_1_3
#define CAM_FRAME_START_ADDR_1_3_POS   (0U)
#define CAM_FRAME_START_ADDR_1_3_LEN   (32U)
#define CAM_FRAME_START_ADDR_1_3_MSK   (((1U << CAM_FRAME_START_ADDR_1_3_LEN) - 1) << CAM_FRAME_START_ADDR_1_3_POS)
#define CAM_FRAME_START_ADDR_1_3_UMSK  (~(((1U << CAM_FRAME_START_ADDR_1_3_LEN) - 1) << CAM_FRAME_START_ADDR_1_3_POS))

/* 0x9C : frame_byte_cnt1_3 */
#define CAM_FRAME_BYTE_CNT1_3_OFFSET (0x9C)
#define CAM_FRAME_BYTE_CNT_1_3       CAM_FRAME_BYTE_CNT_1_3
#define CAM_FRAME_BYTE_CNT_1_3_POS   (0U)
#define CAM_FRAME_BYTE_CNT_1_3_LEN   (32U)
#define CAM_FRAME_BYTE_CNT_1_3_MSK   (((1U << CAM_FRAME_BYTE_CNT_1_3_LEN) - 1) << CAM_FRAME_BYTE_CNT_1_3_POS)
#define CAM_FRAME_BYTE_CNT_1_3_UMSK  (~(((1U << CAM_FRAME_BYTE_CNT_1_3_LEN) - 1) << CAM_FRAME_BYTE_CNT_1_3_POS))

/* 0xA0 : frame_start_addr1_4 */
#define CAM_FRAME_START_ADDR1_4_OFFSET (0xA0)
#define CAM_FRAME_START_ADDR_1_4       CAM_FRAME_START_ADDR_1_4
#define CAM_FRAME_START_ADDR_1_4_POS   (0U)
#define CAM_FRAME_START_ADDR_1_4_LEN   (32U)
#define CAM_FRAME_START_ADDR_1_4_MSK   (((1U << CAM_FRAME_START_ADDR_1_4_LEN) - 1) << CAM_FRAME_START_ADDR_1_4_POS)
#define CAM_FRAME_START_ADDR_1_4_UMSK  (~(((1U << CAM_FRAME_START_ADDR_1_4_LEN) - 1) << CAM_FRAME_START_ADDR_1_4_POS))

/* 0xA4 : frame_byte_cnt1_4 */
#define CAM_FRAME_BYTE_CNT1_4_OFFSET (0xA4)
#define CAM_FRAME_BYTE_CNT_1_4       CAM_FRAME_BYTE_CNT_1_4
#define CAM_FRAME_BYTE_CNT_1_4_POS   (0U)
#define CAM_FRAME_BYTE_CNT_1_4_LEN   (32U)
#define CAM_FRAME_BYTE_CNT_1_4_MSK   (((1U << CAM_FRAME_BYTE_CNT_1_4_LEN) - 1) << CAM_FRAME_BYTE_CNT_1_4_POS)
#define CAM_FRAME_BYTE_CNT_1_4_UMSK  (~(((1U << CAM_FRAME_BYTE_CNT_1_4_LEN) - 1) << CAM_FRAME_BYTE_CNT_1_4_POS))

/* 0xA8 : frame_start_addr1_5 */
#define CAM_FRAME_START_ADDR1_5_OFFSET (0xA8)
#define CAM_FRAME_START_ADDR_1_5       CAM_FRAME_START_ADDR_1_5
#define CAM_FRAME_START_ADDR_1_5_POS   (0U)
#define CAM_FRAME_START_ADDR_1_5_LEN   (32U)
#define CAM_FRAME_START_ADDR_1_5_MSK   (((1U << CAM_FRAME_START_ADDR_1_5_LEN) - 1) << CAM_FRAME_START_ADDR_1_5_POS)
#define CAM_FRAME_START_ADDR_1_5_UMSK  (~(((1U << CAM_FRAME_START_ADDR_1_5_LEN) - 1) << CAM_FRAME_START_ADDR_1_5_POS))

/* 0xAC : frame_byte_cnt1_5 */
#define CAM_FRAME_BYTE_CNT1_5_OFFSET (0xAC)
#define CAM_FRAME_BYTE_CNT_1_5       CAM_FRAME_BYTE_CNT_1_5
#define CAM_FRAME_BYTE_CNT_1_5_POS   (0U)
#define CAM_FRAME_BYTE_CNT_1_5_LEN   (32U)
#define CAM_FRAME_BYTE_CNT_1_5_MSK   (((1U << CAM_FRAME_BYTE_CNT_1_5_LEN) - 1) << CAM_FRAME_BYTE_CNT_1_5_POS)
#define CAM_FRAME_BYTE_CNT_1_5_UMSK  (~(((1U << CAM_FRAME_BYTE_CNT_1_5_LEN) - 1) << CAM_FRAME_BYTE_CNT_1_5_POS))

/* 0xB0 : frame_start_addr1_6 */
#define CAM_FRAME_START_ADDR1_6_OFFSET (0xB0)
#define CAM_FRAME_START_ADDR_1_6       CAM_FRAME_START_ADDR_1_6
#define CAM_FRAME_START_ADDR_1_6_POS   (0U)
#define CAM_FRAME_START_ADDR_1_6_LEN   (32U)
#define CAM_FRAME_START_ADDR_1_6_MSK   (((1U << CAM_FRAME_START_ADDR_1_6_LEN) - 1) << CAM_FRAME_START_ADDR_1_6_POS)
#define CAM_FRAME_START_ADDR_1_6_UMSK  (~(((1U << CAM_FRAME_START_ADDR_1_6_LEN) - 1) << CAM_FRAME_START_ADDR_1_6_POS))

/* 0xB4 : frame_byte_cnt1_6 */
#define CAM_FRAME_BYTE_CNT1_6_OFFSET (0xB4)
#define CAM_FRAME_BYTE_CNT_1_6       CAM_FRAME_BYTE_CNT_1_6
#define CAM_FRAME_BYTE_CNT_1_6_POS   (0U)
#define CAM_FRAME_BYTE_CNT_1_6_LEN   (32U)
#define CAM_FRAME_BYTE_CNT_1_6_MSK   (((1U << CAM_FRAME_BYTE_CNT_1_6_LEN) - 1) << CAM_FRAME_BYTE_CNT_1_6_POS)
#define CAM_FRAME_BYTE_CNT_1_6_UMSK  (~(((1U << CAM_FRAME_BYTE_CNT_1_6_LEN) - 1) << CAM_FRAME_BYTE_CNT_1_6_POS))

/* 0xB8 : frame_start_addr1_7 */
#define CAM_FRAME_START_ADDR1_7_OFFSET (0xB8)
#define CAM_FRAME_START_ADDR_1_7       CAM_FRAME_START_ADDR_1_7
#define CAM_FRAME_START_ADDR_1_7_POS   (0U)
#define CAM_FRAME_START_ADDR_1_7_LEN   (32U)
#define CAM_FRAME_START_ADDR_1_7_MSK   (((1U << CAM_FRAME_START_ADDR_1_7_LEN) - 1) << CAM_FRAME_START_ADDR_1_7_POS)
#define CAM_FRAME_START_ADDR_1_7_UMSK  (~(((1U << CAM_FRAME_START_ADDR_1_7_LEN) - 1) << CAM_FRAME_START_ADDR_1_7_POS))

